src/Documents/ПоступлениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеТоваровИУслуг/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает выборку товаров документа сгруппированных по Номенклатуре
//  и сроку годности если аргумент: отражатьСрокиГодности = Истина
// Параметры:
//  документСсылка - ДокументСсылка.ПоступлениеТоваровИУслуг
//  отражатьСрокиГодности - Булево - Если Истина тогда будет выполнена группировка по срокам годности
//  выгрузить - Булево - Если Истина результат запроса будет выгружен в `ТаблицуЗначений`
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
//  - ТаблицаЗначений
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//      * Сумма - Число - Общая стоимость позиции
//      * СрокГодности - Дата, Неопределено - [Опциональное] в случае если отражатьСрокиГодности = Ложь - поле отсутствует в выборке
//  - Неопределено
Функция ПолучитьТоварыДокумента(Знач документСсылка, Знач отражатьСрокиГодности, Знач выгрузить = Истина) Экспорт
    запросТовары = Новый Запрос;
    запросТовары.УстановитьПараметр("Ссылка", документСсылка);
    запросТовары.Текст =
        "ВЫБРАТЬ
        |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
        |	СУММА(ПоступлениеТоваровТовары.Количество) КАК Количество,
        |   ПоступлениеТоваровТовары.СрокГодности КАК СрокГодности,
        |   ПоступлениеТоваровТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
        |	СУММА(ПоступлениеТоваровТовары.Сумма) КАК Сумма
        |ИЗ
        |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровТовары
        |ГДЕ
        |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	&ПоляГруппировки
        |";

    поляГруппировки =
        "   ПоступлениеТоваровТовары.Номенклатура,
        |	ПоступлениеТоваровТовары.СрокГодности,
        |   ПоступлениеТоваровТовары.Номенклатура.СчетБухгалтерскогоУчета
        |";

    Если НЕ отражатьСрокиГодности Тогда // Удаляем поле СрокГодности из запроса
        запросТовары.Текст = СтрЗаменить(запросТовары.Текст,
                "ПоступлениеТоваровТовары.СрокГодности КАК СрокГодности,", "");
        поляГруппировки = СтрЗаменить(поляГруппировки,
                "ПоступлениеТоваровТовары.СрокГодности,", "");
    КонецЕсли;

    запросТовары.Текст = СтрЗаменить(запросТовары.Текст, "&ПоляГруппировки", поляГруппировки);

    результатЗапроса = запросТовары.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

// Выполняет запрос из ТЧ `Услуги` документа с группировкой по полям: `СтатьяЗатрат`, `Номенклатура`, `СчетБухгалтерскогоУчета`
// Параметры:
//  документСсылка - ДокументСсылка.ПоступлениеТоваровИУслуг
//  выгрузить - Булево - Если Истина будет выполнена Выгрузка данных в таблицу значений
// Возвращаемое значение:
//  - ТаблицаЗначений - Если `выгрузить` = Истина
//  - ВыборкаИзРезультатаЗапроса - Если `выгрузить` = Ложь
Функция ПолучитьУслугиДокумента(Знач документСсылка, Знач выгрузить = Истина) Экспорт
    запрос = Новый Запрос;
    запрос.УстановитьПараметр("Ссылка", документСсылка);
    запрос.Текст =
        "ВЫБРАТЬ
        |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура,
        |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
        |   ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
        |	СУММА(ПоступлениеУслугУслуги.Сумма) КАК Сумма
        |ИЗ
        |	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеУслугУслуги
        |ГДЕ
        |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   ПоступлениеУслугУслуги.СтатьяЗатрат,
        |   ПоступлениеУслугУслуги.Номенклатура,
        |   ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета
        |";

    результатЗапроса = запрос.Выполнить();

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

// Возвращает выборку услуг документа с группировкой по Номенклатуре и Итогами по СтатьямЗатрат
// Параметры:
//  документСсылка - ДокументСсылка.ПоступлениеТоваровИУслуг
//  выгрузить - Булево - по умолчанию = Истина
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса, ТаблицаЗначений
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат, Неопределено
//      * Сумма - Число - Общая стоимость позиции
//  - Неопределено
Функция ПолучитьСтатьиЗатратДокумента(Знач документСсылка, выгрузить = Истина) Экспорт
    запросУслуг = Новый Запрос;
    запросУслуг.УстановитьПараметр("Ссылка", документСсылка);

    запросУслуг.Текст =
        "ВЫБРАТЬ
        |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
        |	СУММА(ПоступлениеУслугУслуги.Сумма) КАК Сумма
        |ИЗ
        |	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеУслугУслуги
        |ГДЕ
        |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   ПоступлениеУслугУслуги.СтатьяЗатрат
        |";

    результатЗапроса = запросУслуг.Выполнить();

    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
